# encoding=utf-8

"""
将提示字符串规整在一起，防止在代码中占用太多地方
统一用note开头

"""

# 初始化图片提示
note_init_pic = \
    """
    ----------------------------------------------------------------------------------
    小提示：
    当前正在生成“三大指数”、“持仓股票”和“关注股票”的小时、日、周和月的MACD图！
    以及日级别的KD、MOM、RSI、SAR等指标的图。
    小时级别的MACD图半小时更新一次，其余图片启动软件时生成最新的，软件开启后暂不更新！
    ----------------------------------------------------------------------------------
    """ + '\n'

# 软件初启动时的日线判断提示

note_day_analysis = \
    """
    ----------------------------------------------------------------------------------
    小提示：
    以下是日线的MACD拐点判断和SAR指标的判断。
    
    红色：未来数日看多
    绿色：未来数日看空
    
    需要观察走势图做进一步的主观判断！
    ----------------------------------------------------------------------------------
    """ + '\n'